Repository: Leon0932/AES-Visualization
Catalog: AESAnimations/Localizable.xcstrings
Source language: de
Languages: en

source: Aktuelle Runde:
en: Current Round:

source: Aktueller Zustand
en: Current State

source: Aktuelles Byte
en: Current Byte

source: Alter Zustand
en: Old State

source: Animation bei Anzeige der View automatisch abspielen
en: Automatically Play Animation When the View Is Displayed

source: Animation starten
en: Start Animation

source: Blockform aus
en: Blockform off

source: Blockform ein
en: Blockform on

source: Die App wurde von **Leon Chamoun** im Rahmen einer Bachelorarbeit entwickelt, die von **Prof. Dr. Christoph Karg** betreut wurde.
en: The App Was Developed by **Leon Chamoun** as Part of a Bachelor Thesis Supervised by **Prof. Dr. Christoph Karg**.

source: Die Implementierung des AES basiert auf der Spezifikation des
en: The Implementation of AES Is Based on the Specification of

source: Die Operation existiert nicht
en: The operation does not exist

source: Diese App ist NICHT für iPad Mini verfügbar.
en: This app is NOT available for iPad Mini.

source: Einstellungen
en: Settings

source: Entschlüsseln
en: Decrypt

source: Entschlüsselungs-Verlauf
en: Decryption History

source: Entschlüsselungsprozess
en: Encryption History

source: Ergebnis
en: Result

source: Erlebe AES-Verschlüsselung wie nie zuvor – interaktive Visualisierung der Algorithmen, klar verständlich und perfekt für Studium oder Entwicklung!
en: Experience AES Encryption like never before - interactive Visualization of the Algorithms, clearly explained and perfect for Study or Development!

source: Generierung der Rundenschlüssel
en: Generation of Round Keys

source: Gültiges Hex-Byte erforderlich (00-FF)
en: Valid hex byte required (00-FF)

source: Hauptrunden:
en: Main Rounds:

source: Inverse S-Box Erstellung
en: Inverse S-Box Creation

source: Letzte Verschiebung
en: Last Shift

source: Multiplikates Inverses
en: Multiplicative Inverse

source: Nach ⊕ mit rCon
en: After ⊕ with rCon

source: Nach AddRoundKey
en: After AddRoundKey

source: Nach erster Verschiebung
en: After First Shift

source: Nach InvMixColumns
en: After InvMixColumns

source: Nach InvShiftRows
en: After InvShiftRows

source: Nach MixColumns
en: After MixColumns

source: Nach RotWord
en: After RotWord

source: Nach ShiftRows
en: After ShiftRows

source: Nach SubBytes
en: After SubBytes

source: Nach SubWord
en: After SubWord

source: Nach zweiter Verschiebung
en: After Second Shift

source: Neuer Zustand
en: New State

source: Position der S-Box
en: Position of the S-Box

source: Rundenkonstante (RCON)
en: Round Constant (RCON)

source: Rundenschlüssel %lld
en: Round Key %lld

source: Rundenschlüssel %lld:
en: Round Key %lld:

source: Rundenschlüssel-Verlauf
en: Round Key History

source: Rundenschlüsselwert
en: Round Key Value

source: S-Box Erstellung
en: S-Box Creation

source: Schlüssel
en: Key

source: Schlüssel (%lld-Bit)
en: Key (%lld-Bit)

source: Schlüssel-Animation ansehen
en: Show Key Animation

source: Schlüsselblock %lld
en: Key Block %lld

source: ShiftRows-Verlauf
en: ShiftRows History

source: Sonstige Einstellungen
en: Further Settings

source: Spalte
en: Col

source: Start der Runde / Nach AddRoundKey
en: Start of Round / After AddRoundKey

source: Start der Runde / Nach InvSubBytes
en: Start of Round / After InvSubBytes

source: Start-Zustand
en: Start State

source: Starten
en: Start

source: Suche Byte
en: Search Byte

source: Umgekehrt
en: Reversed

source: Umgekehrte Animations-Option einblenden
en: Show Reverse Animation Option

source: Urheber der App
en: Creator of the App

source: Verschlüsseln
en: Encrypt

source: Verschlüsselungs-Verlauf
en: Encryption History

source: Wähle Akzentfarbe (%@)
en: Select Accent Color (%@)

source: Wähle App-Sprache (%@)
en: Select App Language (%@)

source: Wähle Erscheinungsbild (%@)
en: Select Appearance (%@)

source: Warnung
en: Warning

source: Wert der S-Box
en: Value of the S-Box

source: Wiederholen
en: Repeat

source: Willkommen zu **AES-Visualization**
en: Welcome to **AES-Visualization**

source: Zeige Akzent Farben
en: Show Accent Colors

source: Zeige Bunte Farben
en: Show Mixed Colors

source: Zeile
en: Row

source: Zustand
en: State
